org-files/wget-and-singlel-quote-in-windows-cmd.org
#+SETUPFILE: setup/css/theme-0.orgcss
#+TITLE: 单引号、双引号与Windows cmd

* 单引号('')、双引号("")与Windows cmd

  cmd似乎会不对单引号做任何处理，直接把单引号作为参数的固有部分传给程
  序[fn:1][fn:2]。写一个小的C程序来演示：

#+BEGIN_SRC shell
#include <stdio.h>

int main (int argc, char * argv[]) {
    for(int i=0; i < argc; i++)
        printf("%s\n", argv[i]);

    return 0;
}
#+END_SRC

#+BEGIN_SRC shell
gcc test.c -o test_cmd.exe
test_cmd.exe abc 'abc' "abc"
#+END_SRC

插一句，在zsh和bash(cygwin, msys2, or linux)里，'abc'这样的参数会被去
掉两端的单引号以后传给程序。

* wget 的 --accept-regex 参数与 Windows cmd

在zsh和bash里，传递给wget的--accpet-regex参数的值，不用引号、用单引号、
用双引号都可以的。

但是在cmd里面就不同了。如前所述，在cmd里，如果参数值被单引号括住，那么
单引号就变成了参数的一部分，然后wget会把  _'\/ZH\/'_  作为正则表达式，
于是就导致除了目标页面本身以外没有其他可以匹配的内容，导致不能递归抓取
数据。

以下面命令为例进行说明。完全不用引号，或者使用双引号，都是ok的：

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" http://www.example.com/ZH/index.html
#+END_SRC

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" http://www.example.com/ZH/index.html
#+END_SRC

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" "http://www.example.com/ZH/index.html"
#+END_SRC

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" "http://www.example.com/ZH/index.html"
#+END_SRC


如果用单引号括住，则两侧的单引号会被 wget 作为待匹配的正则表达式的一部分：

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' http://www.example.com/ZH/index.html
#+END_SRC

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' http://www.example.com/ZH/index.html
#+END_SRC

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' "http://www.example.com/ZH/index.html"
#+END_SRC

#+BEGIN_SRC shell
.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' "http://www.example.com/ZH/index.html"
#+END_SRC

* wget 与 cygwin terminal(mintty)

使用zsh或者bash的时候，则下述方式都能正常地递归抓取数据，因为这两个shell会把括住参数的单引号剥掉以后再传给程序。

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
#+END_SRC

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
#+END_SRC

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" "www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"
#+END_SRC

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex "\/ZH\/" "http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"
#+END_SRC

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
#+END_SRC

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
#+END_SRC

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' "www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"
#+END_SRC

#+BEGIN_SRC shell
wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex '\/ZH\/' "http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"
#+END_SRC

[fn:1] http://oceancolor.gsfc.nasa.gov/forum/oceancolor/topic_show.pl?tid=5195
[fn:2] http://stackoverflow.com/questions/24173825/what-does-single-quote-do-in-windows-batch-files