wget-and-singlel-quote-in-windows-cmd.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-04-04 Wed 13:43 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>单引号、双引号与Windows cmd</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="preamble" class="status">
<p class="date">Published: </p>
</div>
<div id="content">
<h1 class="title">单引号、双引号与Windows cmd</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c5b076">1. 单引号('')、双引号("")与Windows cmd</a></li>
<li><a href="#org9c5152d">2. wget 的 &#x2013;accept-regex 参数与 Windows cmd</a></li>
<li><a href="#org080f868">3. wget 与 cygwin terminal(mintty)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9c5b076" class="outline-2">
<h2 id="org9c5b076"><span class="section-number-2">1</span> 单引号('')、双引号("")与Windows cmd</h2>
<div class="outline-text-2" id="text-1">
<p>
cmd似乎会不对单引号做任何处理，直接把单引号作为参数的固有部分传给程序<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup><sup>, </sup><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。写一个小的C程序来演示：</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ffd700;">#</span><span style="color: #ffd700;">include &lt;stdio.h&gt;</span>

int main (int argc, char * argv[]) {
    <span style="color: #00ffff;">for</span>(int <span style="color: #ffa07a;">i</span>=0; i &lt; argc; i++)
        printf(<span style="color: #ffa500;">"%s\n"</span>, argv[i]);

    <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">gcc test.c -o test_cmd.exe
test_cmd.exe abc <span style="color: #ffa500;">'abc'</span> <span style="color: #ffa500;">"abc"</span>
</pre>
</div>

<p>
插一句，在zsh和bash(cygwin, msys2, or linux)里，'abc'这样的参数会被去掉两端的单引号以后传给程序。</p>
</div>
</div>

<div id="outline-container-org9c5152d" class="outline-2">
<h2 id="org9c5152d"><span class="section-number-2">2</span> wget 的 &#x2013;accept-regex 参数与 Windows cmd</h2>
<div class="outline-text-2" id="text-2">
<p>
在zsh和bash里，传递给wget的&#x2013;accpet-regex参数的值，不用引号、用单引号、用双引号都可以的。</p>

<p>
但是在cmd里面就不同了。如前所述，在cmd里，如果参数值被单引号括住，那么单引号就变成了参数的一部分，然后wget会把  <span class="underline">'\/ZH\/'</span>  作为正则表达式，于是就导致除了目标页面本身以外没有其他可以匹配的内容，导致不能递归抓取数据。</p>

<p>
以下面命令为例进行说明。完全不用引号，或者使用双引号，都是ok的：</p>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> http://www.example.com/ZH/index.html
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> http://www.example.com/ZH/index.html
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> <span style="color: #ffa500;">"http://www.example.com/ZH/index.html"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> <span style="color: #ffa500;">"http://www.example.com/ZH/index.html"</span>
</pre>
</div>


<p>
如果用单引号括住，则两侧的单引号会被 wget 作为待匹配的正则表达式的一部分：</p>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> http://www.example.com/ZH/index.html
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> http://www.example.com/ZH/index.html
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> <span style="color: #ffa500;">"http://www.example.com/ZH/index.html"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">.\wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> <span style="color: #ffa500;">"http://www.example.com/ZH/index.html"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org080f868" class="outline-2">
<h2 id="org080f868"><span class="section-number-2">3</span> wget 与 cygwin terminal(mintty)</h2>
<div class="outline-text-2" id="text-3">
<p>
使用zsh或者bash的时候，则下述方式都能正常地递归抓取数据，因为这两个shell会把括住参数的单引号剥掉以后再传给程序。</p>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> <span style="color: #ffa500;">"www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">"\/ZH\/"</span> <span style="color: #ffa500;">"http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> <span style="color: #ffa500;">"www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">wget.exe -r -l inf --no-remove-listing -np -nc -p --accept-regex <span style="color: #ffa500;">'\/ZH\/'</span> <span style="color: #ffa500;">"http://www.etk.cc/bmw/ZH/search/selectCar/R56N/Cou/BMW+One+Eco+55kW/ECE/"</span>
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://oceancolor.gsfc.nasa.gov/forum/oceancolor/topic_show.pl?tid=5195">http://oceancolor.gsfc.nasa.gov/forum/oceancolor/topic_show.pl?tid=5195</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="http://stackoverflow.com/questions/24173825/what-does-single-quote-do-in-windows-batch-files">http://stackoverflow.com/questions/24173825/what-does-single-quote-do-in-windows-batch-files</a></p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org</a> mode 9.1.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>